<script setup lang="ts">
definePageMeta({
  layout: 'docs'
})

const pageHeader = ref({
  title: 'Для правообладателей',
  description: 'Деятельность Anidzen осуществляется в соответствии с законодательством Армении в области защиты информации и авторских прав на контент.',
  lastModified: '3.14.2025'
})

const copyrightNotice = ref({
  titleId: 1,
  title: 'Для правообладателей',
  sections: [
    {
      id: 1.1,
      description: 'Все размещенные на ресурсе материалы находятся в свободном доступе и могут быть бесплатно скачаны из интернета. Сбор информации в сети и размещение контента в каталоге производится в автоматическом режиме.',
      options: []
    },
    {
      id: 1.2,
      description: 'Публикация нелицензионного, похищенного контента и материалов, защищенных авторским правом, не допускается. Администрация размещает только любительские русскоязычные материалы из свободных источников при использовании автоматической системы.',
      options: []
    },
    {
      id: 1.3,
      description: 'На сайте AnimeGO публикуются только фрагменты материалов, переведенные на русский язык, а также контент с любительским переводом для ознакомительного просмотра. Размещение оригинальных, непереведенных материалов невозможно.',
      options: []
    },
    {
      id: 1.4,
      description: 'Администрация ресурса предлагает сотрудничество с правообладателями контента. В случае нарушения прав собственности сайт обязуется убрать неправомерно размещенный материал или предложить выгодные условия сотрудничества правообладателю.',
      options: []
    },
    {
      id: 1.5,
      description: 'Если вы обнаружили материал, представленный на нашем сайте, который нарушает ваши авторские права, или же дискредитирует Вашу компанию, предоставляя неверную или искаженную информацию, пожалуйста свяжитесь с нами для решения этого вопроса.',
      options: []
    },
    {
      id: 1.6,
      description: 'Для этого необходимо отправить e-mail с вашего корпоративного почтового ящика, содержащий:\n\nконтактные данные, реквизиты вашей компании;\nпрямую ссылку(ссылки) на материал, который вы считаете спорным;\nзаверенные сканированные копии документов, подтверждающих ваше эксклюзивное право на материал;\nв случае, если вы представляете интересы другой компании – копии документов на посреднические услуги;',
      options: []
    },
    {
      id: 1.7,
      description: 'На адрес noreply.anidzen@gmail.com Вся информация будет проверена, и администрация сайта в кратчайшие сроки свяжется с вами для урегулирования спорного вопроса.',
      options: []
    }
  ]
})
</script>

<template>
  <div>
    <section
      id="docs-for-copyright-holders"
      class="docs-for-copyright-holders"
    >
      <UiDocsPageHeader
        :title="pageHeader.title"
        :description="pageHeader.description"
        :last-modified="pageHeader.lastModified"
      />
      <div class="mt-10">
        <UiDocsDocumentSection :data="copyrightNotice" />
      </div>
    </section>
  </div>
</template>
