<script setup lang="ts">
definePageMeta({
  layout: 'docs'
})

const lastModified = ref('3.14.2005')

const definitionOfTerms = ref({
  titleId: 1,
  title: 'Определение терминов',
  sections: [
    {
      id: 1.1,
      description: 'В настоящей Политике конфиденциальности используются следующие термины:',
      options: [
        {
          id: '1.1.1',
          content: '«Администрация приложения» (далее – Администрация) – уполномоченные сотрудники на управление приложением Anidzen.com, которые организуют и (или) осуществляют обработку персональных данных, а также определяют цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.'
        },
        {
          id: '1.1.2',
          content: '«Персональные данные» – любая информация, относящаяся к прямо или косвенно определенному, или определяемому физическому лицу (субъекту персональных данных).'
        },
        {
          id: '1.1.3',
          content: '«Обработка персональных данных» – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.'
        },
        {
          id: '1.1.4',
          content: '«Конфиденциальность персональных данных» – обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.'
        },
        {
          id: '1.1.5',
          content: '«Приложение Anidzen.com» – это цифровая платформа, доступная через веб-интерфейс по уникальному адресу (URL): anidzen.com, а также через мобильные и другие клиентские приложения.'
        },
        {
          id: '1.1.6',
          content: '«Субдомены» – это страницы или совокупность страниц, расположенные на доменах третьего уровня, принадлежащие Anidzen.com, а также другие временные страницы, внизу которых указана контактная информация Администрации.'
        },
        {
          id: '1.1.7',
          content: '«Пользователь приложения Anidzen.com» (далее Пользователь) – лицо, имеющее доступ к Anidzen.com посредством сети Интернет и использующее информацию, материалы и сервисы приложения.'
        },
        {
          id: '1.1.8',
          content: '«Cookies» – небольшой фрагмент данных, отправленный веб-сервером и хранимый на устройстве пользователя, который веб-клиент или браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего приложения.'
        },
        {
          id: '1.1.9',
          content: '«IP-адрес» – уникальный сетевой адрес узла в компьютерной сети, через который Пользователь получает доступ к Anidzen.com.'
        }
      ]
    }

  ]
})

const generalProvisions = ref({
  titleId: 2,
  title: 'Общие положения',
  sections: [
    {
      id: '2.1',
      description: 'Использование приложения Anidzen.com',
      options: [
        {
          id: '2.1.1',
          content: 'Использование приложения Anidzen.com Пользователем означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.'
        },
        {
          id: '2.1.2',
          content: 'В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование приложения Anidzen.com.'
        }
      ]
    },
    {
      id: '2.2',
      description: 'Персональные данные пользователей',
      options: [
        {
          id: '2.2.1',
          content: 'Персональные данные, которые обрабатываются в Anidzen.com, включают: имя, email, данные аккаунта.'
        },
        {
          id: '2.2.2',
          content: 'Пользователь соглашается на обработку персональных данных при регистрации.'
        }
      ]
    }
  ]
})
</script>

<template>
  <div>
    <section
      id="docs-privacy-policy"
      class="docs-privacy-policy"
    >
      <UPageHeader
        title="Политика конфиденциальности"
        description="Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт anidzen, расположенный на доменном имени anidzen.com (а также его субдоменах), может получить о Пользователе во время использования сайта anidzen.com (а также его субдоменов), его программ и его продуктов."
        headline=""
      >
        <template #headline>
          последное обнавление в {{ lastModified }}
        </template>
      </UPageHeader>
      <div class="mt-10">
        <UiDocsDocumentSection :data="definitionOfTerms" />
        <UiDocsDocumentSection :data="generalProvisions" />
      </div>
    </section>
  </div>
</template>
