<script setup lang="ts">
definePageMeta({
  layout: 'docs'
})

const pageHeader = ref({
  title: 'Политика конфиденциальности',
  description: 'Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт anidzen, расположенный на доменном имени anidzen.com (а также его субдоменах), может получить о Пользователе во время использования сайта anidzen.com (а также его субдоменов), его программ и его продуктов.',
  lastModified: '3.14.2025'
})

const definitionOfTerms = ref({
  titleId: 1,
  title: 'Определение терминов',
  sections: [
    {
      id: 1.1,
      description: 'В настоящей Политике конфиденциальности используются следующие термины:',
      options: [
        {
          id: '1.1.1',
          content: '«Администрация приложения» (далее – Администрация) – уполномоченные сотрудники на управление приложением Anidzen.com, которые организуют и (или) осуществляют обработку персональных данных, а также определяют цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.'
        },
        {
          id: '1.1.2',
          content: '«Персональные данные» – любая информация, относящаяся к прямо или косвенно определенному, или определяемому физическому лицу (субъекту персональных данных).'
        },
        {
          id: '1.1.3',
          content: '«Обработка персональных данных» – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.'
        },
        {
          id: '1.1.4',
          content: '«Конфиденциальность персональных данных» – обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.'
        },
        {
          id: '1.1.5',
          content: '«Приложение Anidzen.com» – это цифровая платформа, доступная через веб-интерфейс по уникальному адресу (URL): anidzen.com, а также через мобильные и другие клиентские приложения.'
        },
        {
          id: '1.1.6',
          content: '«Субдомены» – это страницы или совокупность страниц, расположенные на доменах третьего уровня, принадлежащие Anidzen.com, а также другие временные страницы, внизу которых указана контактная информация Администрации.'
        },
        {
          id: '1.1.7',
          content: '«Пользователь приложения Anidzen.com» (далее Пользователь) – лицо, имеющее доступ к Anidzen.com посредством сети Интернет и использующее информацию, материалы и сервисы приложения.'
        },
        {
          id: '1.1.8',
          content: '«Cookies» – небольшой фрагмент данных, отправленный веб-сервером и хранимый на устройстве пользователя, который веб-клиент или браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего приложения.'
        },
        {
          id: '1.1.9',
          content: '«IP-адрес» – уникальный сетевой адрес узла в компьютерной сети, через который Пользователь получает доступ к Anidzen.com.'
        }
      ]
    }

  ]
})

const generalProvisions = ref({
  titleId: 2,
  title: 'Общие положения',
  sections: [
    {
      id: '2.1',
      description: 'Использование приложения Anidzen.com',
      options: [
        {
          id: '2.1.1',
          content: 'Использование приложения Anidzen.com Пользователем означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.'
        },
        {
          id: '2.1.2',
          content: 'В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование приложения Anidzen.com.'
        }
      ]
    },
    {
      id: '2.2',
      description: 'Персональные данные пользователей',
      options: [
        {
          id: '2.2.1',
          content: 'Персональные данные, которые обрабатываются в Anidzen.com, включают: имя, email, данные аккаунта.'
        },
        {
          id: '2.2.2',
          content: 'Пользователь соглашается на обработку персональных данных при регистрации.'
        }
      ]
    }
  ]
})

const subjectOfPrivacyPolicy = ref({
  titleId: 3,
  title: 'Предмет политики конфиденциальности',
  sections: [
    {
      id: '3.1',
      description: 'Настоящая Политика конфиденциальности устанавливает обязательства Администрации по защите и неразглашению конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации при регистрации в приложении Anidzen или при подписке на информационную e-mail рассылку.'
    },
    {
      id: '3.2',
      description: 'Персональные данные, которые разрешено обрабатывать в рамках настоящей Политики конфиденциальности, предоставляются Пользователем при заполнении форм в приложении Anidzen и могут включать следующую информацию:',
      options: [
        { id: '3.2.1', content: 'Фамилию, имя, отчество Пользователя;' },
        { id: '3.2.2', content: 'Адрес электронной почты (e-mail)' },
        { id: '3.2.3', content: 'Место жительства Пользователя (если необходимо)' },
        { id: '3.2.4', content: 'Фотографию (если необходимо)' },
        { id: '3.2.5', content: 'Пол (если необходимо)' }
      ]
    },
    {
      id: '3.3',
      description: 'Anidzen защищает данные, которые автоматически передаются при посещении страниц приложения:',
      options: [
        { id: '3.3.1', content: 'IP адрес;' },
        { id: '3.3.2', content: 'Информация из cookies;' },
        { id: '3.3.3', content: 'Информация о браузере;' },
        { id: '3.3.4', content: 'Время доступа;' },
        { id: '3.3.5', content: 'Реферер (адрес предыдущей страницы).' }
      ]
    },
    {
      id: '3.4',
      description: 'Отключение cookies может привести к ограничению доступа к некоторым частям приложения, требующим авторизации.'
    },
    {
      id: '3.5',
      description: 'Anidzen собирает статистику об IP-адресах своих пользователей для предотвращения, обнаружения и устранения технических проблем.'
    },
    {
      id: '3.6',
      description: 'Любая другая персональная информация, не указанная выше (история посещений, используемые браузеры, операционные системы и т.д.), будет храниться надежно и не будет распространяться, за исключением случаев, предусмотренных п.п. 5.2. настоящей Политики конфиденциальности.'
    }
  ]
})

const purposesOfCollectingUserPersonalInformation = ref({
  titleId: 4,
  title: 'Цели сбора персональной информации пользователя',
  sections: [
    {
      id: '4.1',
      description: 'Персональные данные Пользователя Администрация может использовать в целях:',
      options: [
        { id: '4.1.1', content: 'Идентификации Пользователя, зарегистрированного в приложении Anidzen, для его дальнейшей авторизации.' },
        { id: '4.1.2', content: 'Предоставления Пользователю доступа к персонализированным данным приложения Anidzen.' },
        { id: '4.1.3', content: 'Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования приложения Anidzen, обработки запросов и заявок от Пользователя.' },
        { id: '4.1.4', content: 'Определения места нахождения Пользователя для обеспечения безопасности и предотвращения мошенничества.' },
        { id: '4.1.5', content: 'Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.' },
        { id: '4.1.6', content: 'Создания учетной записи для использования частей приложения Anidzen, если Пользователь дал согласие на создание учетной записи.' },
        { id: '4.1.7', content: 'Уведомления Пользователя по электронной почте.' },
        { id: '4.1.8', content: 'Предоставления Пользователю эффективной технической поддержки при возникновении проблем, связанных с использованием приложения Anidzen.' },
        { id: '4.1.9', content: 'Предоставления Пользователю с его согласия специальных предложений, новостной рассылки и иных сведений от имени приложения Anidzen.' }
      ]
    }
  ]
})

const methodsAndTermsOfProcessingPersonalInformation = ref({
  titleId: 5,
  title: 'Способы и сроки обработки персональной информации',
  sections: [
    {
      id: '5.1',
      description: 'Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.'
    },
    {
      id: '5.2',
      description: 'Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти только по основаниям и в порядке, установленным законодательством.'
    },
    {
      id: '5.3',
      description: 'При утрате или разглашении персональных данных Администрация вправе не информировать Пользователя об утрате или разглашении персональных данных.'
    },
    {
      id: '5.4',
      description: 'Администрация принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.'
    },
    {
      id: '5.5',
      description: 'Администрация совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.'
    }
  ]
})

const rightsAndObligationsOfTheParties = ref({
  titleId: 6,
  title: 'Права и обязанности сторон',
  sections: [
    {
      id: '6.1',
      description: 'Пользователь вправе:',
      options: [
        { id: '6.1.1', content: 'Принимать свободное решение о предоставлении своих персональных данных, необходимых для использования приложения Anidzen, и давать согласие на их обработку.' },
        { id: '6.1.2', content: 'Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.' },
        { id: '6.1.3', content: 'Пользователь имеет право на получение у Администрации информации, касающейся обработки его персональных данных, если такое право не ограничено в соответствии с федеральными законами. Пользователь вправе требовать от Администрации уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав. Для этого достаточно уведомить Администрацию по указанному E-mail адресу.' }
      ]
    },
    {
      id: '6.2',
      description: 'Администрация обязана:',
      options: [
        { id: '6.2.1', content: 'Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.' },
        { id: '6.2.2', content: 'Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. настоящей Политики Конфиденциальности.' },
        { id: '6.2.3', content: 'Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.' },
        { id: '6.2.4', content: 'Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя, или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.' }
      ]
    }
  ]
})

const responsibilitiesOfTheParties = ref({
  titleId: 7,
  title: 'Ответственность сторон',
  sections: [
    {
      id: '7.1',
      description: 'Администрация, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных п.п. 5.2. и 7.2. настоящей Политики Конфиденциальности.'
    },
    {
      id: '7.2',
      description: 'В случае утраты или разглашения Конфиденциальной информации Администрация не несёт ответственность, если данная конфиденциальная информация:',
      options: [
        { id: '7.2.1', content: 'Стала публичным достоянием до её утраты или разглашения.' },
        { id: '7.2.2', content: 'Была получена от третьей стороны до момента её получения Администрацией Ресурса.' },
        { id: '7.2.3', content: 'Была разглашена с согласия Пользователя.' }
      ]
    },
    {
      id: '7.3',
      description: 'Пользователь несет полную ответственность за соблюдение требований законодательства РФ, в том числе законов о рекламе, о защите авторских и смежных прав, об охране товарных знаков и знаков обслуживания, но не ограничиваясь перечисленным, включая полную ответственность за содержание и форму материалов.'
    },
    {
      id: '7.4',
      description: 'Пользователь признает, что ответственность за любую информацию (в том числе, но не ограничиваясь: файлы с данными, тексты и т. д.), к которой он может иметь доступ как к части сайта Anidzen, несет лицо, предоставившее такую информацию.'
    },
    {
      id: '7.5',
      description: 'Пользователь соглашается, что информация, предоставленная ему как часть сайта Anidzen, может являться объектом интеллектуальной собственности, права на который защищены и принадлежат другим Пользователям, партнерам или рекламодателям, которые размещают такую информацию на сайте Anidzen. Пользователь не вправе вносить изменения, передавать в аренду, передавать на условиях займа, продавать, распространять или создавать производные работы на основе такого Содержания (полностью или в части), за исключением случаев, когда такие действия были письменно прямо разрешены собственниками такого Содержания в соответствии с условиями отдельного соглашения.'
    },
    {
      id: '7.6',
      description: 'В отношение текстовых материалов (статей, публикаций, находящихся в свободном публичном доступе на сайте Anidzen) допускается их распространение при условии, что будет дана ссылка на Anidzen.'
    },
    {
      id: '7.7',
      description: 'Администрация не несет ответственности перед Пользователем за любой убыток или ущерб, понесенный Пользователем в результате удаления, сбоя или невозможности сохранения какого-либо Содержания и иных коммуникационных данных, содержащихся на сайте Anidzen или передаваемых через него.'
    },
    {
      id: '7.8',
      description: 'Администрация не несет ответственности за любые прямые или косвенные убытки, произошедшие из-за: использования либо невозможности использования сайта, либо отдельных сервисов; несанкционированного доступа к коммуникациям Пользователя; заявления или поведение любого третьего лица на сайте.'
    },
    {
      id: '7.9',
      description: 'Администрация не несет ответственность за какую-либо информацию, размещенную пользователем на сайте Anidzen, включая, но не ограничиваясь: информацию, защищенную авторским правом, без прямого согласия владельца авторского права.'
    }
  ]
})

const disputeResolution = ref({
  titleId: 8,
  title: 'Разрешение споров',
  sections: [
    {
      id: '8.1',
      description: 'До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией, обязательным является предъявление претензии (письменного предложения или предложения в электронном виде о добровольном урегулировании спора).'
    },
    {
      id: '8.2',
      description: 'Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно или в электронном виде уведомляет заявителя претензии о результатах рассмотрения претензии.'
    },
    {
      id: '8.3',
      description: 'К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией применяется действующее законодательство Российской Федерации.'
    }
  ]
})

const additionalTerms = ref({
  titleId: 9,
  title: 'Дополнительные условия',
  sections: [
    {
      id: '9.1',
      description: 'Администрация вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.'
    },
    {
      id: '9.2',
      description: 'Новая Политика конфиденциальности вступает в силу с момента ее размещения на сайте Anidzen, если иное не предусмотрено новой редакцией Политики конфиденциальности.'
    },
    {
      id: '9.3',
      description: 'Все предложения или вопросы касательно настоящей Политики конфиденциальности следует сообщать по адресу: anidzen@gmail.com'
    }
  ]
})
</script>

<template>
  <div>
    <section
      id="docs-privacy-policy"
      class="docs-privacy-policy"
    >
      <UiDocsPageHeader
        :title="pageHeader.title"
        :description="pageHeader.description"
        :last-modified="pageHeader.lastModified"
      />
      <div class="mt-10">
        <UiDocsDocumentSection :data="definitionOfTerms" />
        <UiDocsDocumentSection :data="generalProvisions" />
        <UiDocsDocumentSection :data="subjectOfPrivacyPolicy" />
        <UiDocsDocumentSection :data="purposesOfCollectingUserPersonalInformation" />
        <UiDocsDocumentSection :data="methodsAndTermsOfProcessingPersonalInformation" />
        <UiDocsDocumentSection :data="rightsAndObligationsOfTheParties" />
        <UiDocsDocumentSection :data="responsibilitiesOfTheParties" />
        <UiDocsDocumentSection :data="disputeResolution" />
        <UiDocsDocumentSection :data="additionalTerms" />
      </div>
    </section>
  </div>
</template>
