<script setup lang="ts">
definePageMeta({
  layout: 'docs'
})

const lastModified = ref('3.14.2005')

const terms = ref([
  {
    id: '1.1.1',
    content: '«Администрация сайта» (далее – Администрация) – уполномоченные сотрудники на управление сайтом AnimeGO, которые организуют и (или) осуществляют обработку персональных данных, а также определяют цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.'
  },
  {
    id: '1.1.2',
    content: '«Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному, или определяемому физическому лицу (субъекту персональных данных).'
  },
  {
    id: '1.1.3',
    content: '«Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.'
  },
  {
    id: '1.1.4',
    content: '«Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.'
  },
  {
    id: '1.1.5',
    content: '«Сайт AnimeGO» - это совокупность связанных между собой веб-страниц, размещенных в сети Интернет по уникальному адресу (URL): animego.club, а также его субдоменах.'
  },
  {
    id: '1.1.6',
    content: '«Субдомены» - это страницы или совокупность страниц, расположенные на доменах третьего уровня, принадлежащие сайту AnimeGO, а также другие временные страницы, внизу которых указана контактная информация Администрации.'
  },
  {
    id: '1.1.7',
    content: '«Пользователь сайта AnimeGO» (далее Пользователь) – лицо, имеющее доступ к сайту AnimeGO, посредством сети Интернет и использующее информацию, материалы и продукты сайта AnimeGO.'
  },
  {
    id: '1.1.8',
    content: '«Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.'
  },
  {
    id: '1.1.9',
    content: '«IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, через который Пользователь получает доступ на AnimeGO.'
  }
])
</script>

<template>
  <div>
    <section
      id="docs-privacy-policy"
      class="docs-privacy-policy"
    >
      <UPageHeader
        title="Политика конфиденциальности"
        description="Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт anidzen, расположенный на доменном имени anidzen.com (а также его субдоменах), может получить о Пользователе во время использования сайта anidzen.com (а также его субдоменов), его программ и его продуктов."
        headline=""
      >
        <template #headline>
          последное обнавление в {{ lastModified }}
        </template>
      </UPageHeader>
      <div>
        <UiDocsSectionTitle
          :title-id="1"
          title="Определение терминов"
          :description-id="1.1"
          description="В настоящей Политике конфиденциальности используются следующие термины:"
        >
          <template #content>
            <div
              v-for="term in terms"
              :key="term.id"
            >
              <UiDocsTextBlock
                :id="term.id"
                :content="term.content"
              />
            </div>
          </template>
        </UiDocsSectionTitle>
      </div>
    </section>
  </div>
</template>

<style scoped>

</style>
